/******************************************************************************
 *实现Lcd1602的显示输出
 ******************************************************************************/
#include "lcd.h"

/*******************************************************************************
 * 函 数 名         : Lcd1602_Delaynus
 * 函数功能		   : 延时函数，延时1ms
 * 输    入         : c
 * 输    出         : 无
 * 说    名         : 该函数是在12MHZ晶振下，12分频单片机的延时。
 *******************************************************************************/
void Lcd1602_Delaynus(uint c) //误差 0us
{
	while (--c)
		;
}

/*******************************************************************************
 * 函 数 名         : LcdWriteCom
 * 函数功能		   : 向LCD写入一个字节的命令
 * 输    入         : com
 * 输    出         : 无
 *******************************************************************************/
#ifndef LCD1602_4PINS		//当没有定义这个LCD1602_4PINS时
void LcdWriteCom(uchar com) //写入命令
{
	LCD1602_E = 0;	//使能
	LCD1602_RS = 0; //选择发送命令
	LCD1602_RW = 0; //选择写入

	LCD1602_DATAPINS = com; //放入命令
	Lcd1602_Delaynus(40);	//等待数据稳定,40us差不多

	LCD1602_E = 1;		 //写入时序
	Lcd1602_Delaynus(40); //保持时间,40us差不多
	LCD1602_E = 0;
}
#else
void LcdWriteCom(uchar com) //写入命令
{
	LCD1602_E = 0;	//使能清零
	LCD1602_RS = 0; //选择写入命令
	LCD1602_RW = 0; //选择写入

	LCD1602_DATAPINS = com; //由于4位的接线是接到P0口的高四位，所以传送高四位不用改
	Lcd1602_Delaynus(40);

	LCD1602_E = 1; //写入时序
	Lcd1602_Delaynus(40);
	LCD1602_E = 0;

	LCD1602_DATAPINS = com << 4; //发送低四位
	Lcd1602_Delaynus(40);

	LCD1602_E = 1; //写入时序
	Lcd1602_Delaynus(40);
	LCD1602_E = 0;
}
#endif
/*******************************************************************************
 * 函 数 名         : LcdWriteData
 * 函数功能		   : 向LCD写入一个字节的数据
 * 输    入         : dat
 * 输    出         : 无
 *******************************************************************************/
#ifndef LCD1602_4PINS
void LcdWriteData(uchar dat) //写入数据
{
	LCD1602_E = 0;	//使能清零
	LCD1602_RS = 1; //选择输入数据
	LCD1602_RW = 0; //选择写入

	LCD1602_DATAPINS = dat; //写入数据
	Lcd1602_Delaynus(40);

	LCD1602_E = 1;		 //写入时序
	Lcd1602_Delaynus(40); //保持时间
	LCD1602_E = 0;
}
#else
void LcdWriteData(uchar dat) //写入数据
{
	LCD1602_E = 0;	//使能清零
	LCD1602_RS = 1; //选择写入数据
	LCD1602_RW = 0; //选择写入

	LCD1602_DATAPINS = dat; //由于4位的接线是接到P0口的高四位，所以传送高四位不用改
	Lcd1602_Delaynus(40);

	LCD1602_E = 1; //写入时序
	Lcd1602_Delaynus(40);
	LCD1602_E = 0;

	LCD1602_DATAPINS = dat << 4; //写入低四位
	Lcd1602_Delaynus(40);

	LCD1602_E = 1; //写入时序
	Lcd1602_Delaynus(40);
	LCD1602_E = 0;
}
#endif
/*******************************************************************************
 * 函 数 名       : LcdInit()
 * 函数功能		 : 初始化LCD屏
 * 输    入       : 无
 * 输    出       : 无
 *******************************************************************************/
#ifndef LCD1602_4PINS
void LcdInit() // LCD初始化子程序
{
	LcdWriteCom(0x38); //开显示
	LcdWriteCom(0x0c); //开显示不显示光标
	LcdWriteCom(0x06); //写一个指针加1
	LcdWriteCom(0x01); //清屏
	LcdWriteCom(0x80); //设置数据指针起点
}
#else
void LcdInit() // LCD初始化子程序
{
	LcdWriteCom(0x32); //将8位总线转为4位总线
	LcdWriteCom(0x28); //在四位线下的初始化
	LcdWriteCom(0x0c); //开显示不显示光标
	LcdWriteCom(0x06); //写一个指针加1
	LcdWriteCom(0x01); //清屏
	LcdWriteCom(0x80); //设置数据指针起点
}
#endif

/******************************************************************************
 *函数名称：LcdPrintf
 *函数功能：LCD输出32字符串
 *入口函数：unsigned char 数组
 *出口函数：无
 ****************************************************************************/
void LcdPrintf(uchar Disp[])
{
	uchar i;
	LcdInit();
	
	for (i = 0; i < 16; i++)
	{
		LcdWriteData(Disp[i]);
	}
	LcdWriteCom(0x80 + 0x40); //设置数据指针起点
	for (; i < 32; i++)
	{
		LcdWriteData(Disp[i]);
	}
}