/*******************************************************************************
 *名称：weigang.h
 *功能：weigang.c的头文件
 *******************************************************************************/
#include <REGX52.H>

////////////////////////////////////////////////////////////////////////////////
sbit DATA0 = P3 ^ 2; //数据线0
sbit DATA1 = P3 ^ 3; //数据线1

////////////////////////////////////////////////////////////////////////////////
typedef unsigned int u16;
typedef unsigned char u8;

////////////////////////////////////////////////////////////////////////////////
/*定义韦根卡的一个结构体*/
struct wiegand_dev
{
    char wiegand[26]; // 定义Weigand  26Bits 数据
    unsigned char state;
    int global_var; // 全局计数器 计数组长度
};
static struct wiegand_dev *rf_card;
/*结构体，左边指针用->，左边变量用.*/

////////////////////////////////////////////////////////////////////////////////

/******************************************************************************
 *函数名称：initial(void)
 *函数功能：中断初始化
 *入口函数：无
 *出口函数：无
 ******************************************************************************/
void initial(void)
{
    IT0 = 0; // Wiegand-Data0        低电平触发中断
    EX0 = 1; //外部中断0允许
    IT1 = 0; // Wiegand-Data1 低电平触发中断
    EX1 = 1; //外部中断1允许
    EA = 1;  //开CPU中断
}

/******************************************************************************
 *函数名称：udelay(u16 num)
 *函数功能：延时函数 延时num  us
 *入口函数：num
 *出口函数：无
 ******************************************************************************/
void udelay(u16 num)
{
    num = num / 5;
    while (--num)
        ;
}