/*
07_数码管秒表和定时器中断
    功能
        利用定时器进行精准的秒表计时,利用动态数码管进行144hz刷新显示时钟
    目的
        1 复习计时器
        2 复习中断
*/

#include "reg52.h"

////////////////////////////////////////////////////////////////////////////////
typedef unsigned int u16;
typedef unsigned char u8;

sbit LSA = P2 ^ 2;
sbit LSB = P2 ^ 3;
sbit LSC = P2 ^ 4;

////////////////////////////////////////////////////////////////////////////////
u16 sss = 0, ssec = 0, sec = 0, min = 0, h = 0;                                          //次数，毫秒，秒，分 ,小时
u8 code smgduan[9] = {0X00, 0X3F, 0X06, 0X5B, 0X4F, 0X66, 0X6D, 0X7D, 0X07, 0X7F, 0X6F}; //显示0~9的值

////////////////////////////////////////////////////////////////////////////////

/*******************************************************************************
* 函 数 名      : Timer0Init
* 函数功能      : 定时器初始化函数
* 输    入      : 
* 输    出      : 
*******************************************************************************/
void Timer0Init(void)
{
    TMOD |= 0X10; // 设置工作方式为1，16位定时/计数器
    TL0 = 0X00;   // 定时器0低八位赋初值
    TH0 = 0X00;   // 定时器0高八位赋初值
    ET0 = 1;      // 定时器0中断打开
    EA = 1;       // 总中断打开
    TR0 = 1;      // 控制定时器，1为打开
}

/*******************************************************************************
* 函 数 名      : Display_Timer1
* 函数功能      : 显示和延时函数
* 输    入      : unsigned int,unsigned char[0~7]为第0~7位数码管的显示数字
* 输    出      : 
*******************************************************************************/
void Display_Timer1(u8 smgxianshi[])
{
    u8 i;

    for (i = 0; i < 8; i++)
    {
        P0 = 0X00; //消隐
        switch (i) //位选，选择点亮的数码管，
        {
        case (0):
            LSA = 1;
            LSB = 1;
            LSC = 1;
            break; //显示第0位
        case (1):
            LSA = 0;
            LSB = 1;
            LSC = 1;
            break; //显示第1位
        case (2):
            LSA = 1;
            LSB = 0;
            LSC = 1;
            break; //显示第2位
        case (3):
            LSA = 0;
            LSB = 0;
            LSC = 1;
            break; //显示第3位
        case (4):
            LSA = 1;
            LSB = 1;
            LSC = 0;
            break; //显示第4位
        case (5):
            LSA = 0;
            LSB = 1;
            LSC = 0;
            break; //显示第5位
        case (6):
            LSA = 1;
            LSB = 0;
            LSC = 0;
            break; //显示第6位
        case (7):
            LSA = 0;
            LSB = 0;
            LSC = 0;
            break; //显示第7位
        }
        P0 = smgxianshi[i];
    }
}

/*******************************************************************************
* 函 数 名      : main
* 函数功能      : 主函数
* 输    入      : 
* 输    出      : 
*******************************************************************************/
void main(void)
{
    Timer0Init(); // 开启计时器0

    while (1)
    {
        if (sss == 18)
        {
            ssec += 5; // +5ms
            sss = 0;

            if (ssec == 1000)
            {
                sec += 1; // +1s
                ssec = 0;

                if (sec == 60)
                {
                    min += 1; // +1min
                    sec = 0;

                    if (min == 60)
                    {
                        h += 1; // +1h
                        min = 0;

                        if (h == 24)
                        {
                            h = 0; // 24h归零
                        }
                    }
                }
            }
        }
    }
    
}

void Timer0(void) interrupt 1
{
    sss += 1; // 记录+1次，18次为5ms
}

// 2021年8月10号17点04分