/*
04_LED矩阵
    功能
        逐行扫描，led显示出几个汉字或字母
    目的
        1 掌握led显示编程
        2 
*/

#include "reg52.h"   // 在reg52.h文件中已经定于过了RCLK,所以用reg51.h
#include <intrins.h> // 一般程序中需要使用到空指令_nop_();字符循环移位指令_crol_等时使用。

typedef unsigned int u16;
typedef unsigned char u8;

sbit HC595_SRCLK = P3 ^ 6; // 74HC595位移寄存器时钟输入
sbit HC595_RCLK = P3 ^ 5;  // 74HC595储存寄存器时钟输入
sbit HC595_SER = P3 ^ 4;   // 74HC595串行数据输入

u8 ledwei[] = {0X80, 0X40, 0X20, 0X10, 0X08, 0X04, 0X02, 0X01}; // led位选
u8 ledduan[];                                                   // led段选

/*******************************************************************************
* 函 数 名      : delay
* 函数功能      : 延时函数
* 输    入      : unsigned int
* 输    出      : 无
* 注            ：S = 0.00001T + 0.00002 = 1E-05x + 2E-05
*******************************************************************************/
void delay(u16 i);
/*******************************************************************************
* 函 数 名      : LedLattice
* 函数功能      : led点阵显示函数,8*8的led点阵
* 输    入      : unsigned char
* 输    出      : 无
*******************************************************************************/
void LedLattice(u8 dat);

/*******************************************************************************
* 函 数 名      : main
* 函数功能      : 主函数
* 输    入      : 
* 输    出      : 
*******************************************************************************/
void main()
{
    u8 i;

    while (1)
    {
    }
}

void delay(u16 i)
{
    while (i--)
        ;
}

void LedLattice(u8 dat)
{
    u8 i;

    for (i = 0; i < 8; i++)
    {
        HC595_SER = ledwei[i];

    }
}

// 2021年8月10号17点04分